/*
  =================================================================================
                              | 什么是存钱罐? |
  ---------------------------------------------------------------------------------
  存钱不是一个难题! 每次你往存钱罐里投钱，都会伴随着音乐和灯光。
  虽然只是一小步，但是离你接下来想要的东西更近了一点，这种感觉不是很好吗？

  =================================================================================
                                    | 开始 |
  ---------------------------------------------------------------------------------
  用传感器和一些声光效果把日常事物变得更有趣。
  =================================================================================
                            | 自己动手修改代码! |
  ---------------------------------------------------------------------------------
  点开 userDef.h 文件，然后根据你自己的喜好更改下面的参数。 :)

  LINE_MAX:   灰度传感器检测的触发值。
  BRIGHT_MAX: LED彩灯显示的最大亮度。

  修改完这些值后，记得再把代码上传到mBattery里。
  =================================================================================
                               |头脑风暴|
  ---------------------------------------------------------------------------------
  1. 可以再加一个投币口/灰度传感器吗?
     一个用来投一元硬币，另一个用来投一角和五角的硬币。
  2. 能否把代码改成当攒够一定量的钱时播放某一首特别的音乐吗？
  3. 可以给存钱罐加上一个电机吗?
     你是怎样想到的！听到硬币叮叮当当的响声一定很酷！

    注意: 以上功能上的变动会涉及到程序上的改动。
  =================================================================================
                                | 端口连接|
  ---------------------------------------------------------------------------------
  ColorLED:   D12
  蜂鸣器:     D10
  灰度传感器: A0
  =================================================================================
                                   |问题 |
  ---------------------------------------------------------------------------------
  欢迎访问 http://forum.microduino.cn/，在我们的论坛提交您的问题， 我们会尽快回复您。
*/
#include <Microduino_Key.h>
#include "colorLed.h"
#include "music.h"
#include "userDef.h"

AnalogKey keyCoin(PIN_LINEA);

void setup() {
  Serial.begin(9600);
  strip.begin();
  strip.setBrightness(BRIGHT_MAX);
  keyCoin.begin(INPUT);
#if DEBUG
  Serial.println("**************START************");
#endif
}

void loop() {
#if DEBUG
  Serial.print("LINE Val:");
  Serial.println(analogRead(PIN_LINEA));       //灰度传感器检测到的亮度。
#endif
  if (keyCoin.readEvent(0, LINE_MAX) == SHORT_PRESS) //检查是否有硬币投入。
    playIndex = 0;                              //开始播放音乐。

  if (!playSound(1))          //播放音乐。
  {
    noTone(PIN_BUZZER);
    ledBreath(COLOR_GREEN, 15);
    //setAllLed(COLOR_NONE);
  }
}
