#define DEBUG       0       //串口调试功能  打开/关闭.
#define PIN_KEYA    6       //碰撞传感器A引脚.
#define PIN_KEYB    8       //碰撞传感器B引脚.
#define PIN_BUZZER  10      //蜂鸣器引脚.
#define PIN_LED     12      //彩灯引脚.
#define LED_NUM     2       //彩灯数量

//=================================自己动手修改参数!========================================//
//示例: 将 "#define BRIGHT_MAX 128" 修改成 "#define BRIGHT_MAX 180".                        //
//         意味着LED彩灯的显示亮度会变亮.                                                   //
//                                                                                          //
//提示: 参数修改完后，记得将代码重新上传到mBattery模块！                                    //
//==========================================================================================//
#define BRIGHT_MAX  10     //LED彩灯显示的最大亮度。最大亮度是255，最小亮度是0

#define SCORE_MAX 5        //判断游戏获胜的分差，默认为5分，即当一方得分比另一方得分多5分时，得分多者获胜！

#define LED_INTERVAL 800  //彩灯切换颜色的速率，数字1000即为1秒间隔，2000即为2秒间隔...
//减少这个数值，会增加游戏的难度，考验人的反应速度。
//尝试把这个值调整为200，挑战一下自己的反射神经
