/*
  =================================================================================
                               | 声控风车是什么? |
  ---------------------------------------------------------------------------------
  这是一个可以用声音控制的风车！声音可以触发风车转动，同时LED灯变换颜色。

  =================================================================================
                                    | 开始|
  ---------------------------------------------------------------------------------
  用麦克风作为声音传感器，用电机模块来驱动风车转动。
  =================================================================================
                            | 自己动手修改代码!|
  ---------------------------------------------------------------------------------
  点开 userDef.h 文件，然后根据你自己的喜好更改下面的参数。 :)

  VOICE_MIN:       启动风车的声音触发值。
  MOTOR_SPEED_MAX: 风车转动时的转速。
  TIME_RUN:        风车启动后，电机和LED彩灯的持续工作时间。
  BRIGHT_MAX:      LED彩灯显示的最大亮度。

  修改完这些值后，记得再把代码上传到mBattery里。
  =================================================================================
                               | 头脑风暴 |
  ---------------------------------------------------------------------------------
  1. 除了声音，还可以用什么来控制风车？
     按钮? 光照传感器? 遥控...
  2. 可以在风车另一边再加上一个电机吗？
     可以，风车看上去会有些怪异。:)
  3. 可以把风车改成风扇吗？
     装上扇叶就可以，改成的风扇会吹出微风。:)

    注意: 以上功能上的变动会涉及到程序上的改动。
  =================================================================================
                                | 端口连接 |
  ---------------------------------------------------------------------------------
  电机:      可以连接到Motor模块的任一端口。
  Motor模块：D5,D7,D6,D8
  MIC传感器：A6
  ColorLED： D12
  =================================================================================
                                   |问题 |
  ---------------------------------------------------------------------------------
  欢迎访问 http://forum.microduino.cn/，在我们的论坛提交您的问题， 我们会尽快回复您。
*/

#include <Microduino_Key.h>
#include"userDef.h"
#include"colorLed.h"
#include"motor.h"

AnalogKey keyMic(PIN_MIC);

void setup() {
  Serial.begin(9600);
  strip.begin();
  strip.setBrightness(BRIGHT_MAX);
  keyMic.begin(INPUT);
  MotorLeft.begin();
  MotorRight.begin();
#if DEBUG
  Serial.println("**************START************");
#endif
}

void loop() {
#if DEBUG
  Serial.print("MIC Val:");
  Serial.println(analogRead(PIN_MIC));
#endif
  if (keyMic.readEvent(VOICE_MIN, VOICE_MAX) == SHORT_PRESS)  //如果声音传感器检测到了声音，风车和LED灯将会启动。
  {
    uint32_t motorTimer = millis();
    while (millis() - motorTimer < TIME_RUN)            //在检测到声音的10秒钟以内
    {
      motorRun(MOTOR_SPEED_MAX, MOTOR_SPEED_MAX);       //启动电机。
      ledRainbow(10);                                   //LED开始变换彩虹颜色。
    }
  }
  else                                   //检测到声音10秒钟以后
  {
    motorFree();                        //关掉电机。
    setAllColor(COLOR_NONE);              //关掉LED灯。
  }
}
